<?php
namespace common\widgets\doc\purchase;

/**
 * $URL: https://tarax.toyouke.com/svn/MALL/common/widgets/doc/purchase/OutputCsv.php $
 * $Id: OutputCsv.php 2787 2017-05-09 06:29:23Z $
 */

use Yii;
use yii\helpers\ArrayHelper;
use \common\models\Company;
use \common\models\Payment;
use \common\models\CsvFormat;

class OutputCsv extends \yii\base\Widget
{
    // // 保冷種別
    const TYPE_COLD_NONE     = 0; // 保冷無し
    const TYPE_COLD_CHILLED  = 1; // チルド
    const TYPE_COLD_FROZEN   = 2; // 冷凍

    // 送り状種別
    const TYPE_INVOICE_PREPAID = 0; // 発払い
    const TYPE_INVOICE_COLLECT = 2; // コレクト

    // 配送業者
    const DELIVERY_YAMATO  = 1;
    const DELIVERY_YUPRINT = 2;

    /* @var Purchase model */
    public $model;

    /* @var	ご請求先顧客コード */
    public $customercode = null;

    public $product_name = null;

    public $items = [];

    public $eol = "\r\n";

    public $yu_pack_header = [
             1      =>  '出荷元会員番号',
             2      =>  '出荷元PC ID',
             3      =>  '出荷元ログイングループID',
             4      =>  '出荷元ログインユーザID',
             5      =>  '出荷元ログイングループ名称',
             6      =>  '出荷元ログインユーザ名称',
             7      =>  '出荷元郵便番号',
             8      =>  '出荷元電話番号',
             9      =>  '出荷元住所-JIS１１',
             10     =>  '出荷元住所-番地',
             11     =>  '出荷元住所-号',
             12     =>  '出荷元住所-ビル名',
             13     =>  'テンプレート番号',
             14     =>  'お届け先グループコード',
             15     =>  '処理番号',
             16     =>  'お客様側管理番号',
             17     =>  'お問い合わせ番号',
             18     =>  '代表お問い合わせ番号',
             19     =>  '発送予定日',
             20     =>  '発送予定時間区分',
             21     =>  '発送日',
             22     =>  '出荷期限日',
             23     =>  '到着期限日',
             24     =>  '郵便種別',
             25     =>  '保冷種別',
             26     =>  '元／着払／代引',
             27     =>  '書留／セキュリティ／特定記録種別',
             28     =>  '配送時間帯指定郵便種別',
             29     =>  '送り状種別',
             30     =>  'お届け先 検索キー',
             31     =>  'お届け先 郵便番号',
             32     =>  'お届け先 住所',
             33     =>  'お届け先 住所２',
             34     =>  'お届け先 住所３',
             35     =>  'お届け先 名称',
             36     =>  'お届け先 名称２',
             37     =>  'お届け先 フリガナ',
             38     =>  'お届け先 フリガナ２',
             39     =>  'お届け先 敬称区分',
             40     =>  'お届け先 電話番号',
             41     =>  'お届け先 メールアドレス１',
             42     =>  'お届け先 メール１種別',
             43     =>  'お届け先 メールアドレス２',
             44     =>  'お届け先 メール２種別',
             45     =>  'お届け先 局留め区分',
             46     =>  'お届け先 局留め郵便局名',
             47     =>  'お届け先 局留め住所',
             48     =>  'お届け先 局留めメール使用区分',
             49     =>  'お届け先 局留め郵便番号',
             50     =>  'お届け先 配送予告メール使用区分',
             51     =>  'お届け先 再配送予告メール使用区分',
             52     =>  'お届け先 住所コード',
             53     =>  'お届け先 カスタマバーコード',
             54     =>  'ご依頼主 検索キー',
             55     =>  'ご依頼主 利用者同一区分',
             56     =>  'ご依頼主 集荷先と同一区分',
             57     =>  'ご依頼主 郵便番号',
             58     =>  'ご依頼主 住所',
             59     =>  'ご依頼主 住所２',
             60     =>  'ご依頼主 住所３',
             61     =>  'ご依頼主 名称',
             62     =>  'ご依頼主 名称２',
             63     =>  'ご依頼主 フリガナ',
             64     =>  'ご依頼主 フリガナ２',
             65     =>  'ご依頼主 敬称',
             66     =>  'ご依頼主 電話番号',
             67     =>  'ご依頼主 メールアドレス１',
             68     =>  'ご依頼主 メール種別１',
             69     =>  'ご依頼主 メールアドレス２',
             70     =>  'ご依頼主 メール種別２',
             71     =>  'ご依頼主 荷送人指図区分',
             72     =>  'ご依頼主 お届け通知メール使用区分',
             73     =>  'ご依頼主 お届け通知はがき使用区分',
             74     =>  'ご依頼主 住所コード',
             75     =>  'ご依頼主 カスタマバーコード',
             76     =>  'ご依頼主 メール利用区分',
             77     =>  '集荷先 検索キー',
             78     =>  '集荷先 連携可否区分',
             79     =>  '集荷先 会社コード',
             80     =>  '集荷先 依頼先店所コード',
             81     =>  '集荷先 郵便番号',
             82     =>  '集荷先 住所',
             83     =>  '集荷先 住所２',
             84     =>  '集荷先 住所３',
             85     =>  '集荷先 名称',
             86     =>  '集荷先 名称２',
             87     =>  '集荷先 フリガナ',
             88     =>  '集荷先 フリガナ２',
             89     =>  '集荷先 敬称',
             90     =>  '集荷先 電話番号',
             91     =>  '集荷先 住所コード',
             92     =>  '受注番号',
             93     =>  'こわれもの区分',
             94     =>  'なまもの区分',
             95     =>  'ビン類区分',
             96     =>  '逆さま厳禁区分',
             97     =>  '下積み厳禁区分',
             98     =>  '商品サイズ／厚さ区分',
             99     =>  '重量合計（ｇ）',
             100    =>  '閾値重量（ｇ）',
             101    =>  '25kg超重量物区分',
             102    =>  '書留 損害要償額',
             103    =>  '速遉／配送日指定種別',
             104    =>  '配送希望日',
             105    =>  '配送指定日曜日種別',
             106    =>  '配送時間帯区分',
             107    =>  '差出方法区分',
             108    =>  'ゆうパック往復割引',
             109    =>  'ゆうパック数量割引',
             110    =>  'ゆうパック複数個割引',
             111    =>  'ゆうパック同一割引',
             112    =>  'ゆうパック政策遀賃割引',
             113    =>  'セット商品コード',
             114    =>  'セット品名ラベル印字区分',
             115    =>  '複数個口数',
             116    =>  '記事名１',
             117    =>  '記事名２',
             118    =>  'フリー項目０１',
             119    =>  'フリー項目０２',
             120    =>  'フリー項目０３',
             121    =>  'フリー項目０４',
             122    =>  'フリー項目０５',
             123    =>  'フリー項目０６',
             124    =>  'フリー項目０７',
             125    =>  'フリー項目０８',
             126    =>  'フリー項目０９',
             127    =>  'フリー項目１０',
             128    =>  '空港利用区分',
             129    =>  '空港送遉日数利用マップID',
             130    =>  '空港送遉日数郵便番号',
             131    =>  '空港送遉日数局／支店コード',
             132    =>  '航空会社名',
             133    =>  '利用便名',
             134    =>  'レジャー区分',
             135    =>  'プレー・搭乗日',
             136    =>  'プレー・搭乗時間',
             137    =>  'クラブ本数',
             138    =>  '復路集貨日',
             139    =>  '送状発行場所区分',
             140    =>  '出荷先会員番号',
             141    =>  '出荷先PC ID',
             142    =>  '出荷先ログイングループID',
             143    =>  '出荷先ログインユーザID',
             144    =>  '出荷先ログイングループ名称',
             145    =>  '出荷先ログインユーザ名称',
             146    =>  '出荷先郵便番号',
             147    =>  '出荷先電話番号',
             148    =>  '出荷先住所-JIS１１',
             149    =>  '出荷先住所-番地',
             150    =>  '出荷先住所-号',
             151    =>  '出荷先住所-ビル名',
             152    =>  '出荷先送状発行通知区分',
             153    =>  '出荷先送状発行通知メールアドレス',
             154    =>  '集荷希望区分',
             155    =>  '集荷日付',
             156    =>  '集荷時間帯区分',
             157    =>  '支店連携区分',
             158    =>  '代引金額',
             159    =>  '代引消費税金額',
             160    =>  '代引課税対象額',
             161    =>  '代引印紙税額',
             162    =>  '代引送金手数料',
             163    =>  '代引送金金額',
             164    =>  '代引まとめ区分',
             165    =>  '代引送金方法区分',
             166    =>  '往路遀賃',
             167    =>  '復路遀賃',
             168    =>  '基本料金小計',
             169    =>  '割増金額',
             170    =>  '速遉・配送日指定料金内訳',
             171    =>  '保冷料金内訳',
             172    =>  '割引金額',
             173    =>  '郵便料金小計',
             174    =>  '書留料金',
             175    =>  '代引引換手数料',
             176    =>  '調整額',
             177    =>  'その他料金小計',
             178    =>  '遀賃消費税(外税)',
             179    =>  '領収金額計',
             180    =>  '請求金額',
             181    =>  '請求金額内消費税',
             182    =>  '不在留め置き期間',
             183    =>  '郵便番号エラー区分',
             184    =>  '業種区分',
             185    =>  '貨物商品コード',
             186    =>  '特殊輸送区分',
             187    =>  '仕分番号',
             188    =>  '配送店コード',
             189    =>  '事業所私書箱区分',
             190    =>  '着遀賃ブロック',
             191    =>  '支払方法区分',
             192    =>  '遚用特別料金種別',
             193    =>  '料金体系区分',
             194    =>  '料金計算用サイズまたは重量',
             195    =>  '料金計算区分',
             196    =>  '料金計算エラー区分',
             197    =>  '消費税課税負担者区分',
             198    =>  '消費税計算区分',
             199    =>  '引換金計算種別',
             200    =>  '差出／集荷局 郵便番号',
             201    =>  '差出／集荷地 邴遈府県コード',
             202    =>  '差出／集荷地 市区町村コード',
             203    =>  '地帯区分',
             204    =>  '交付種別',
             205    =>  '加入者名',
             206    =>  '振替口座',
             207    =>  '総合口座',
             208    =>  '代引まとめ精算 代引金額',
             209    =>  '代引まとめ精算 代引消費税金額',
             210    =>  '代引まとめ精算 代引課税対象額',
             211    =>  '代引まとめ精算 代引印紙税額',
             212    =>  '代引まとめ精算 代引送金手数料',
             213    =>  '代引まとめ精算 代引送金金額',
             214    =>  '代引まとめ精算データ書き込み日付',
             215    =>  '代引まとめ 代金入金日付',
             216    =>  '代引まとめ 計理日付',
             217    =>  '代引まとめ決済種別',
             218    =>  '外邪データ取込年月日',
             219    =>  '連携データ受信年月日',
             220    =>  '集約年月日',
             221    =>  '連携データ年月日',
             222    =>  '送り状発行年月日',
             223    =>  '受付店控え印刷年月日',
             224    =>  '追跡番号付番年月日',
             225    =>  '発送予約データ作成年月日',
             226    =>  '仮引受データ作成年月日',
             227    =>  '遀賃計算年月日',
             228    =>  'お届け先 メール作成年月日',
             229    =>  'ご依頼主 メール送信年月日',
             230    =>  '差出票印刷年月日',
             231    =>  '受領書印刷年月日',
             232    =>  '大口FD出力年月日',
             233    =>  'プレ印字年月日',
             234    =>  '仮引受確定作業年月日',
             235    =>  '郤送完了作業年月日',
             236    =>  '事故完了作業年月日',
             237    =>  '代引送金完了作業年月日',
             238    =>  '配送ステータス集約コード',
             239    =>  '配送ステータス明細コード',
             240    =>  '出荷元先区分',
             241    =>  '入力区分',
             242    =>  '入力補助区分',
             243    =>  '遀賃使用区分',
             244    =>  'ゆうメール特別(承認)使用区分',
             245    =>  '総個数（集約前）',
             246    =>  '複数個口数・荷札枚数（集約前）',
             247    =>  '代引金額（集約前）',
             248    =>  '代引消費税金額（集約前）',
             249    =>  '貨物価格（集約前）',
             250    =>  '重量（ｇ）（集約前）',
             251    =>  '閾値重量（ｇ）（集約前）',
             252    =>  '書留 損害要償額（集約前）',
             253    =>  '商品番号',
             254    =>  '品名',
             255    =>  '個数',
             256    =>  '重量（ｇ）',
             257    =>  '単価',
             258    =>  '金額',
             259    =>  '商品備考０１',
             260    =>  '商品備考０２',
             261    =>  '商品備考０３',
             262    =>  '商品備考０４',
             263    =>  '商品備考０５',
             264    =>  '商品備考０６',
             265    =>  '商品備考０７',
             266    =>  '商品備考０８',
             267    =>  '商品備考０９',
             268    =>  '商品備考１０',
             269    =>  'お客様指定郤送種類',
             270    =>  '予約・確定識別コード',
             271    =>  'コンビニ等判別コード',
             272    =>  'コンビニ等受取 通販業者コード',
             273    =>  'コンビニ等受取 コンビニコード',
             274    =>  'コンビニ等受取 コンビニ名',
             275    =>  'コンビニ等受取 店舗コード',
             276    =>  'コンビニ等受取 店舗名',
             277    =>  'コンビニ等受取 認証番号',
        ];

    public function init()
    {
        parent::init();
    }

    public function run()
    {
        return $this->renderCsv();
    }

    protected function renderCsv()
    {
        $items = $this->setItems();

        return '"' . implode('","', $this->items) . '"' . $this->eol;
    }

    private function setItems($shipping_company = null)
    {
        if(! $delivery = $this->model->delivery)
            return null;

        $model       = $this->model;
        $branch      = $model->branch;
        $expect_date = $delivery->expect_date ? $delivery->expect_date  : '';
        $expect_time = $delivery->expect_time ? $delivery->time->csv_id : '';
        $addr        = self::adjustAddrField($delivery);
        $email       = $model->email ? $model->email : (($c = $model->customer) ? $c->email : null);
        $cool        = (Company::PKEY_TY == $model->company_id)
                     ? self::TYPE_COLD_FROZEN /*冷蔵*/ : self::TYPE_COLD_NONE /*通常*/;
        $invoice_type  = in_array($model->payment_id, [Payment::PKEY_YAMATO_COD, Payment::PKEY_DROP_SHIPPING])
                     ? self::TYPE_INVOICE_COLLECT /* コレクト */ : self::TYPE_INVOICE_PREPAID; /* 発払 */

        // 項目取得用SQL
        // $sql = csvFormat::find()->select(['column_id', 'column_name', 'initial_value']);

        // // 配送業者指定（指定がない場合は、）
        // if (! is_null($shipping_company) && in_array($shipping_company, [self::DELIVERY_YAMATO, self::DELIVERY_YUPRINT]))
        //     $sql->andWhere(['delivery' => $shipping_company]);

        // // 出力対象　全項目
        // $all_column = ArrayHelper::map($sql->all(), 'column_id', 'initial_value');

        // $this->items = [
        //     16 =>  $model->purchase_id,                  // 16 お客様側管理番号
        //     19 =>  date('y/m/d'),                        // 19  発送予定日
        //     24 =>  1,                                    // 24  郵便種別
        //     25 =>  0,                                    // 25  保冷種別
        //     26 =>  2,                                    // 26  元／着払／代引
        //     31 =>  $delivery->zip,                       // 31  お届け先 郵便番号
        //     32 =>  $addr[0],                             // 32  お届け先 住所
        //     33 =>  $addr[1],                             // 33  お届け先 住所２
        //     34 =>  $addr[2],                             // 34  お届け先 住所３
        //     35 =>  $delivery->name,                      // 35  お届け先 名称
        //     36 =>  "",                                   // 36  お届け先 名称２
        //     39 =>  0,                                    // 39  お届け先 敬称区分
        //     40 =>  $delivery->tel,                       // 40  お届け先 電話番号
        //     57 =>  $model->branch->zip,                         // 57  ご依頼主 郵便番号
        //     58 =>  preg_replace('/ /','',$model->branch->addr), // 58  ご依頼主 住所
        //     59 =>  "",                                   // 59  ご依頼主 住所２
        //     60 =>  "",                                   // 60  ご依頼主 住所３
        //     61 =>  "豊受モール {$branch->name}",           // 61  ご依頼主 名称
        //     62 =>  "",                                   // 62  ご依頼主 名称２
        //     65 =>  "",                                   // 65  ご依頼主 敬称
        //     66 =>  $model->branch->tel,                         // 66  ご依頼主 電話番号
        //     93 =>  0,                                    // 93  こわれもの区分
        //     94 =>  0,                                    // 94  なまもの区分
        //     95 =>  0,                                    // 95  ビン類区分
        //     96 =>  0,                                    // 96  逆さま厳禁区分
        //     97 =>  0,                                    // 97  下積み厳禁区分
        //     98 =>  "",                                   // 98  商品サイズ／厚さ区分
        //     158 => $model->total_charge,                 // 158 代引金額
        //     159 => $model->tax,                          // 159 代引消費税金額
        //     254 => $this->product_name,                  // 254 品名
        // ]; 

        // return array_replace($all_column, $this->items);   
    }


    /**
     * @brief クロネコヤマトCSVの住所文字数上限(32, 16, 25)に揃える
     */
    protected static function adjustAddrField($delivery)
    {
        $pref   = $delivery->pref ? $delivery->pref->name : '';
        $addr01 = $delivery->addr01;
        $addr02 = $delivery->addr02;
        $addr   = [];

        mb_internal_encoding("utf-8");

        if(mb_strlen($delivery->addr, 'utf-8') <= 32)
        {
            $addr[0] = $pref . $addr01 . $addr02;
            $addr[1] = null;
            $addr[2] = null;
        }
        elseif((mb_strlen($pref . $addr01, 'utf-8') <= 32 ) && (mb_strlen($addr02, 'utf-8') <= 16))
        {
            $addr[0] = $pref . $addr01;
            $addr[1] = $addr02;
            $addr[2] = null;
        }
        elseif((mb_strlen($pref . $addr01, 'utf-8') <= 32 ) && (mb_strlen($addr02, 'utf-8') <= 25))
        {
            $addr[0] = $pref . $addr01;
            $addr[1] = null;
            $addr[2] = $addr02;
        }
        elseif((mb_strlen($pref . $addr01, 'utf-8') <= (32 + 16)) && (mb_strlen($addr02, 'utf-8') <= 25))
        {
            $addr[0] = mb_substr($pref . $addr01, 0, 32);
            $addr[1] = mb_substr($pref . $addr01, 32);
            $addr[2] = $addr02;
        }
        elseif((mb_strlen($pref . $addr01, 'utf-8') <= 32) && (mb_strlen($addr02, 'utf-8') <= (16 + 25)))
        {
            $addr[0] = $pref . $addr01;
            if(mb_strlen($addr02, 'utf-8') <= 25)
            {
                $addr[1] = null;
                $addr[2] = $addr02;
            }
            else
            {
                $addr[1] = mb_substr($addr02, 0, 16);
                $addr[2] = mb_substr($addr02, 16);
            }
        }
        else
        {
            $whole = $pref . $addr01 . $addr02;
            $addr[0] = mb_substr($whole, 0, 32);  // 32 文字
            $addr[1] = mb_substr($whole, 32, 16); // 16 文字
            $addr[2] = mb_substr($whole, 32 + 16);// 何文字か不明、はみ出たら誰かが手作業で修正するはず
        }

        return $addr;
    }

}