<?php
/**
 * $URL: https://tarax.toyouke.com/svn/MALL/common/mail/m160415_032922_migrate_students_and_hpath.php $
 * $Id: m160415_032922_migrate_students_and_hpath.php 2437 2016-04-16 06:33:31Z mori $
 *
 *
 * @var $this     yii\web\View
 * @var $customer common\models\Customer
 */

?>
<?= $customer->name ?> 様

今月初めに日本ホメオパシー財団、日本ホメオパシー医学協会、CHhomよりメールでご案内差し上げましたとおり、このたび「豊受オーガニクスモール」への会員情報の移行手続きをご本人の同意を得たものとして実施させていただきました。

１）初期パスワードを設定すると、豊受モールにログインできるようになります
２）初期パスワードを設定しなくても、お手元の豊受モール会員証をご持参いただくことによりお買い物のご優待が受けられます

初期パスワードの設定は以下のURLからお手続きください

https://mall.toyouke.com/index.php/site/forgot-password

なお「ID または メールアドレス」欄にはお客様のメールアドレス（このメールの宛先）をご入力ください。

なお、豊受オーガニクスモールのオープン日を５月１日予定としてご案内しておりましたが、突発的な問題が生じ、大幅に延期せざるを得ない状況となってしまいました。オープンを楽しみにしていた皆様には大変申しわけなく、深くお詫び申し上げます。一日も早いオープンを目指したいと思っておりますが、７月オープンとなる可能性が大きい状況です。何卒ご了承くださいますようお願い申し上げます。

住所や電話番号、メールアドレス等変更がありましたら、各自で豊受モールにログインして変更してください。ただし、モールがオープンするまでは、お手数ですが、上記作業すると共に、以下の事務局までご一報ください。

今後ともよろしくご愛顧のほどお願い申し上げます。

豊受モール 事務局 <member@toyouke.com>
https://mall.toyouke.com

------------------------------------------------------------
本メールは手続きが確定した時点で送信される自動配信メールです。このメールに
心当たりのない場合は member@toyouke.com までご連絡いただけますよう
お願い申し上げます。
------------------------------------------------------------
