<?php
/**
 * $URL: https://tarax.toyouke.com/svn/MALL/common/mail/thankyou-echom-pre_order-text.php $
 * $Id: thankyou-purchase-text.php 2545 2016-05-26 08:39:17Z naito $
 *
 *
 * @var $this yii\web\View
 * @var $pre_order_code
 * @var $pre_order_period
 */
?>
-----------------------------------------------------------------
【コングレス会場参加者限定】事前注文受付のお知らせ
-----------------------------------------------------------------

キャンペーンコード：<?= $pre_order_code ?>

利用期間：
<?= $pre_order_period ?>


コングレス会場参加者限定での事前注文受付を行います。
豊受モールにて、事前にご注文いただいた商品を
コングレス当日に会場（Chhom東京校）にて受け取りができるサービスとなります。

会場受け取りですので、送料はかかりません。

コングレス開催時のお買い物特典（３０％ポイント付与）も適用されます。
熱海物流センター発送商品が対象となります。
対象商品群：「レメディー・マザーチンクチャー・自然化粧品・書籍」
※一部対象外となる商品があります。

豊受自然農の加工食品は対象外ですので、ご注意ください。

事前注文受付期間中に、所定のキャンペーンコードを入力していただくと、
事前注文分として受付いたします。

お支払い方法は口座振替支払い限定となります。


キャンペーンコード：<?= $pre_order_code ?>


キャンペーン内容：
■すべての会員様対象
「レメディー・マザーチンクチャー・自然化粧品・書籍」
…　＼30%ポイント／還元
※一部対象外となる商品があります。

利用期間：
<?= $pre_order_period ?>


利用方法：
豊受モールでお買い物の際、
注文確認画面で「キャンペーンコード入力」していただければ、事前注文として受付けします。

▼当キャンペーンに関するお問い合わせ
Email: ec-chhom@homoeopathy.ac

-----------------------------------------------------------------
カレッジ・オブ・ホリスティック・ホメオパシー
〒158-0096　東京都世田谷区玉川台2-2-3 矢藤第３ビル
TEL： 03-5797-3250　FAX： 03-5797-3251
Email: ec-chhom@homoeopathy.ac
-----------------------------------------------------------------
本メールはお客様の申込が確定した時点で送信される自動配信メールです。
このメールに心当たりのない場合は、 ec-chhom@homoeopathy.ac　までご連絡いただけますようお願い申し上げます。
