<?php
use yii\helpers\Html;

/**
 * $URL: https://tarax.toyouke.com/svn/MALL/frontend/views/site/policy.php $
 * $Id: policy.php 1552 2015-09-26 13:25:56Z mori $
 *
 * @var $this \yii\web\View
 */

$title = "プライバシーポリシー";
$this->title = sprintf('%s | %s', $title, Yii::$app->name);
$this->params['breadcrumbs'][] = $title;
$this->params['body_id']       = 'About';
?>
<div class="site-about">

    <h1 class="mainTitle"><?= Html::encode($this->title) ?></h1>

    <p class="mainLead">
        ★個人情報の取り扱いについて
    </p>

    <h2>
    ★個人情報の取り扱いについて
    </h2>

    <p>
<?= nl2br("
日本豊受自然農株式会社（以下、「当社」）が運営する豊受オーガニクスショッピングモールで取り扱う個人情報は、「個人情報の保護に関する法律」に基づき、運営事務局が厳重に管理し、かつ相当の目的に添う限りで、利用させていただきます。
下記、記載されている内容は、予告なく変更・改訂されることがありますので、予めご了承ください。

1.豊受オーガニクスショッピングモール会員以外の顧客の個人情報を取り扱うに当たり、予めその利用目的を特定いたします。
　豊受オーガニクスショッピングモールで取り扱う、豊受オーガニクスショッピングモール会員以外の顧客の個人情報(住所・氏名・電話番号・FAX番号・携帯電話番号・メールアドレスなどの個人情報)は、以下の目的で利用させていただきます。

　(1)豊受オーガニクスショッピングモールでのショッピングの受付、商品の配送やそれに付随した業務
　(2)ご意見、ご感想、アンケート等の依頼、法の定めによる場合を除き、上記の目的以外には利用いたしません。

2.豊受オーガニクスショッピングモール会員の個人情報を取り扱うに当たり、予めその利用目的を特定いたします。
　豊受オーガニクスショッピングモールで取り扱う、豊受オーガニクスショッピングモール会員の住所・氏名・電話番号・FAX番号・携帯電話番号・生年月日・性別・　商品購買履歴・メールアドレス・職業・ポイント情報・会員区分・とらのこ会入会、　更新状況・RAH/CHhom入学、卒業状況・有する資格・家族会員情報などの個人　情報は、以下の目的で利用させていただきます。

　(1)豊受オーガニクスショッピングモールサイトにおいての個人認証および会員情報の確認
　(2)豊受オーガニクスショッピングモールでのショッピングの受付、商品の配送やそれに付随した業務
　(3)カタログやDMの送付、関連するアフターサービス、新商品・サービスに関する情報のご案内
　(4)ご意見、ご感想、アンケート等の依頼、メルマガ配信（ご希望者）
　(5)豊受オーガニクスショッピングモールに出店企業の直営店および販売店での売上・ポイント処理
　(6)日本ホメオパシー医学協会認定の日本ホメオパシーセンターと、とらのこ会提携施設でのホメオパシーとらのこ会にご入会・ご更新済みかどうかの確認、法の定めによる場合を除き、上記の目的以外には利用いたしません。

3.会員の個人情報は、会員へのサービスの提供に必要なものに限り、必要以上に
　情報を取得することはいたしません。

4.会員から個人情報をお預かりする際は、その利用目的を明らかにし、会員の同意を得ます。

5.会員の個人情報を利用する際は、会員に同意をいただいた利用目的の範囲内で行います。

6.会員の個人情報への不正アクセス、紛失、破壊、改ざんおよび漏えいなどのリスクに対し、必要かつ適切な安全対策を講じます。また会員の個人情報を正確かつ最新の内容に保つよう努めます。

7.会員の個人情報保護を徹底するため、個人情報保護管理者を定め、個人情報の適切な管理に努めます。

8.会員の個人情報の取り扱いを委託する際は、個人情報の安全管理が図られるよう委託先を必要かつ適切に監督いたします。

9.会員の個人情報については、以下の何れかに該当する場合を除き、第三者に提供・開示等をすることはありません。 
　(1)会員の事前の同意・承諾を得た場合
　(2)個人情報に関する機密保持契約を締結している業務委託会社に対して、会員に明示した利用の達成に必要な範囲で個人情報の取り扱いを委託する場合（例：業務委託会社とは、商品配送を請け負う宅配業者［口座振替決済サービスなどを含む］、カタログ配送や各種ご案内のための宛名ラベルの印刷会社など）
　(3)個人情報を共同利用する関係会社・団体に対して、守秘義務に基づき、会員に明示した利用目的の達成に必要な範囲で、個人情報を共同利用する場合　
　(4)法令等に基づき、提供に応じなければならない場合
　(5)人の生命、身体又は財産といった具体的な権利利益が侵害されるおそれがあり、これを保護するために個人情報を提供する必要がある場合であって、お客さまご本人から同意を得ることが困難である場合
　(6)国の機関等が法令の定める事務を実施する上で、民間企業等の協力を得る必要がある場合であって、協力する民間企業等（当社）が当該国の機関等に個人情報を　提供することについてお客さまご本人の同意を得ることが困難である場合

10.個人情報（会員情報）の閲覧・変更・訂正につきましては、会員自らが豊受オーガニクスショッピングモールサイトに自己のIDとパスワードでログインし、会員ページから閲覧・変更・訂正することとします

11.個人情報の利用停止等の手続きについては、当社所定の方法によって当社に届け出るものとします。

12.当ポリシーの内容を継続的に見直し、その改善に努めます。

★当社が保有する豊受オーガニクスショッピングモールの個人情報の開示、利用停止、消去等について

　当社が保有する豊受オーガニクスショッピングモールの個人情報は、ご本人さまから請求があった場合、開示いたします。
　会員ご自身の個人情報の利用目的の通知・開示・利用停止・消去などをご希望の場合は、下記のお問い合わせ窓口に電話にてお申し込みいただいた後、当社規定の書類を送付させていただきますので、必要事項をご記入いただき、運転免許証、パスポート等のコピーにより、ご本人または代理人であることを確認させていただいた上で、対応させていただきます。なお、ご請求いただく際は、以下の点にご留意ください。 　
　・代理人の方がご請求される場合は、ご本人からの委任状等が必要となります。
　・郵送でご請求される場合の請求方法・手数料等については、末尾の窓口までお問い合わせください。

　個人情報の内容の問い合わせに関しましては、当社規定の書類(電話にてご請求ください)を郵送にてご提出いただき、後日、当社から書面を以って回答させていただきます。本手続きについては、別途手数料を申し受ける場合がございますので、予めご了承ください。
　なお、お問い合わせの内容によっては、ご本人確認のため、ご来社をお願いする場合がございますので、予めご了承ください。

★個人情報の共同利用について

　豊受オーガニクスショッピングモール出店企業、提携団体は、会員様からお預かりした個人情報（以下「個人情報」）を、商品情報やイベント等のご案内などの販促活動、および受注・売り上げ処理・お届け（配送）・アフターサービス・とらのこ会入会、更新受付など、販売サービス業務関連目的に利用させていただきます。この場合、当社は、当該業務委託先が個人情報の漏洩、目的外利用、再提供などをすることのないよう、契約により禁止を義務づけ、厳重な管理を実施いたします。
ただし、会員が各種ご案内について中止の申し入れを行ったとき、当社は業務、運営上支障がない範囲でこれを中止するものとします。

1.豊受オーガニクスショッピングモール出店企業、提携団体が共同利用する個人情報の項目は以下の通りです。
住所、氏名、電話番号、FAX番号、携帯電話番号、生年月日、性別、商品購買履歴、メールアドレス、職業、ポイント情報、会員区分、ホメオパシーとらのこ会入会・更新状況、RAH/CHhom入学・卒業状況、資格、家族会員情報等。
上記の個人情報を共同利用する企業、団体につきましては、豊受オーガニクスショッピングモールサイトにてご確認ください。

2.豊受オーガニクスショッピングモール出店企業の販売店が共同利用する個人情報の項目は以下の通りです。
　豊受オーガニクスショッピングモール会員証の提示を受けた際、会員の氏名、ポイント情報、会員区分、ホメオパシーとらのこ会入会・更新状況などを開示します。
上記の個人情報を共同利用する一部販売店につきましては、豊受オーガニクスショッピングモールサイトにてご確認ください。

3.日本ホメオパシー医学協会認定の日本ホメオパシーセンター、とらのこ会提携施設が共同利用する個人情報の項目は以下の通りです。
　豊受オーガニクスショッピングモール会員証の提示を受けた際、会員の氏名、ホメオパシーとらのこ会ご入会・ご更新状況、会員区分などを開示します。
　上記の個人情報を共同利用する日本ホメオパシーセンター、とらのこ会提携施設につきましては、豊受オーガニクスショッピングモールサイトにてご確認ください。

★個人情報のセキュリティについて

1.クッキー（cookie）について
　豊受オーガニクスショッピングモールに会員が再度訪問されたときなどに、より便利に閲覧していただくため、会員がご使用のコンピューターを識別する、クッキー（cookie）と呼ばれるデータを送付し、ハードディスクに記録することがあります。なお、クッキーは、会員個人を識別するものではありません。
　また、会員がご使用になるインターネット閲覧ソフトの設定を変更することにより、豊受オーガニクスショッピングモールから送付されるクッキーの受け取りを拒否することが可能です。これにより豊受オーガニクスショッピングモールにおけるサービスが正常にご利用頂けない場合がございますので、予めご了承ください。

2.リンク先に関する免責
　豊受オーガニクスショッピングモールの出店企業以外のリンク先の第三者企業においては、「豊受オーガニクスショッピングモールのプライバシーポリシー」の責任範囲外となり、その第三者企業が設定するプライバシーポリシーに準じることとなります。当社は、これらの独立した規定や活動に対していかなる義務や責任を負うことはできません。

3.SSLについて
　豊受オーガニクスショッピングモールでは、会員登録および、アンケート回答の際など、個人情報が送受信されるページにおいて、SSL（Secure　Socket　Layer）による暗号化通信を使用し、会員のみなさまの個人情報を外部の第三者が通信傍受できないよう対策を行っています。


お問い合わせ窓口

日本豊受自然農株式会社  東京事務所　TEL: 03-5797-3371
受付日時：水曜日〜日曜日 午前10時〜午後5時
（定休日: 月曜日、火曜日　祝日の月、火曜日は受付）
")?>
</p>

</div>
